Ran Plan for 2 projects:

1. project: `nonprod` dir: `.` workspace: `default`
1. project: `prod` dir: `.` workspace: `default`
---

### 1. project: `nonprod` dir: `.` workspace: `default`
**Plan Error**
```
running 'sh -c' '/usr/local/bin/terraform plan -input=false -refresh -out "/home/atlantis/.atlantis/repos/ryan-longoria/socialmedia_automation/7/default/nonprod-default.tfplan" -var-file=tfvars/nonprod-ue2-animeutopia.tfvars -var-file=/home/atlantis/.atlantis/nonprod-ue2-animeutopia.tfvars' in '/home/atlantis/.atlantis/repos/ryan-longoria/socialmedia_automation/7/default': exit status 1
Wrote /home/atlantis/.atlantis/prod-ue2-animeutopia.tfvars with secrets from SSM.

╷
│ Error: Failed to read variables file
│ 
│ Given variables file
│ /home/atlantis/.atlantis/nonprod-ue2-animeutopia.tfvars does not exist.
╵

```

---
### 2. project: `prod` dir: `.` workspace: `default`
<details><summary>Show Output</summary>

```diff
Wrote /home/atlantis/.atlantis/prod-ue2-animeutopia.tfvars with secrets from SSM.


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # aws_lambda_function.notify_post will be updated in-place
~ resource "aws_lambda_function" "notify_post" {
        id                             = "notify_post"
        tags                           = {}
        # (29 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "SNS_TOPIC_ARN" = "arn:aws:sns:us-east-2:481665084477:anime_post_notifications"
              - "TARGET_BUCKET" = "prod-animeutopia-media-bucket"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.upload_project will be created
+ resource "aws_lambda_function" "upload_project" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "./artifacts/scripts/AnimeUtopia/upload_project/upload_project.zip"
      + function_name                  = "upload_project"
      + handler                        = "upload_project.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::481665084477:role/anime_lambda_role"
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "DeployedBy" = "Terraform"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "TARGET_BUCKET" = "prod-animeutopia-media-bucket"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

Plan: 1 to add, 1 to change, 0 to destroy.
╷
│ Warning: Argument is deprecated
│ 
│   with aws_s3_bucket.media_bucket,
│   on main.tf line 8, in resource "aws_s3_bucket" "media_bucket":
│    8: resource "aws_s3_bucket" "media_bucket" {
│ 
│ Use the aws_s3_bucket_versioning resource instead
│ 
│ (and 3 more similar warnings elsewhere)
╵
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://18.217.82.45:4141/lock?id=ryan-longoria%252Fsocialmedia_automation%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p prod
  ```
Plan: 1 to add, 1 to change, 0 to destroy.

---
### Plan Summary

2 projects, 1 with changes, 0 with no changes, 1 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```